<details ><summary>Digger run report at 2025-05-29 13:32:19 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # module.gce.google_compute_instance.competition_instance[1] will be created
  + resource "google_compute_instance" "competition_instance" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + effective_labels        = (known after apply)
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "e2-micro"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = (sensitive value)
      + min_cpu_platform        = (known after apply)
      + name                    = "instance-kaggle-demo-1"
      + project                 = "kaggle-infra-exp-0808"
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + terraform_labels        = (known after apply)
      + zone                    = "asia-northeast1-c"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "ubuntu-os-cloud/ubuntu-2004-lts"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + size                   = (known after apply)
              + type                   = (known after apply)
            }
        }

      + confidential_instance_config (known after apply)

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity (known after apply)

      + scheduling (known after apply)

      + service_account {
          + email  = "instance-service-account@kaggle-infra-exp-0808.iam.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

  # module.network.google_compute_address.static_ip[1] will be created
  + resource "google_compute_address" "static_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "static-ip-kaggle-demo-1"
      + network_tier       = "PREMIUM"
      + prefix_length      = (known after apply)
      + project            = "kaggle-infra-exp-0808"
      + purpose            = (known after apply)
      + region             = "asia-northeast1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + terraform_labels   = (known after apply)
      + users              = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
module.network.google_compute_address.static_ip[1]: Creating...
module.network.google_compute_address.static_ip[1]: Still creating... [00m10s elapsed]
module.network.google_compute_address.static_ip[1]: Creation complete after 12s [id=projects/kaggle-infra-exp-0808/regions/asia-northeast1/addresses/static-ip-kaggle-demo-1]
module.gce.google_compute_instance.competition_instance[1]: Creating...
module.gce.google_compute_instance.competition_instance[1]: Still creating... [00m10s elapsed]
module.gce.google_compute_instance.competition_instance[1]: Creation complete after 17s [id=projects/kaggle-infra-exp-0808/zones/asia-northeast1-c/instances/instance-kaggle-demo-1]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```
</details>
</details>